InformationRegisters/CRM_СтоимостьПродленнойГарантии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_СтоимостьПродленнойГарантии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредложениеПГ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ПредложенияПродленнойГарантии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_СтоимостьПродленнойГарантии/Forms/ФормаВыбораУпр/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Истина;
	ОповеститьОВыборе(Новый Структура("ПГ, Сумма", Элементы.Список.ТекущиеДанные.ПредложениеПГ, Элементы.Список.ТекущиеДанные.Сумма));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Модель") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Модель", Параметры.Модель);
		ЭтаФорма.Заголовок = "Предложения продленной гарантии по модели " + Параметры.Модель; 
	КонецЕсли;
	
КонецПроцедуры
